[
{"count":23,"date":"2016-10-06T08:30:15+0000"},
{"_type":"category","_id":"AVeQyTlo7FG0uL66Doa0","_source":{"name":"Law","premium":true,"url":"\/categories\/law"}},
{"_type":"article","_id":"AVeROuDn7FG0uL66DobL","_source":{"title":"Facebook at Work to take on LinkedIn and Google Drive – today's Open Thread","author":"Stuart Dredge","image":"c2d14db4931192a91cf74fefbf33ef300a1af9f9.jpeg","category":"AVeQybI27FG0uL66Doa2","content":"Facebook may control the social graph of 1.3 billion people, but now it has ambitions to stretch deeper into the workplace, according to the Financial Times’ report on plans for “Facebook at Work”.\r\n\r\nThis isn’t about getting around corporate firewalls to ensure you can see which Frozen character your friends are, though. It’s a proper move to compete with services from Google Drive and LinkedIn to Slack, and become a serious working tool.\r\n\r\n“The Silicon Valley company is developing a new product designed to allow users to chat with colleagues, connect with professional contacts and collaborate over documents,” claimed the FT.\r\n\r\n“The new site will look very much like Facebook – with a newsfeed and groups – but will allow users to keep their personal profile with its holiday photos, political rants and silly videos separate from their work identity.”\r\n\r\nIt might be a sensible move for Facebook, but how will workers (and bosses) feel about their data being shared and stored on the social network? Workplace collaboration in the cloud isn’t an alien concept for many businesses now, but I wonder how Facebook providing this will be received.\r\n\r\nWhat do you think? The comments section is open for your thoughts.","created_at":"2016-10-04T19:45:37+0000","updated_at":"2016-10-04T19:45:37+0000","comments":[],"url":"\/article\/facebook_at_work_to_take_on_linkedin_and_google_drive__todays_open_thread\/"}},
{"_type":"article","_id":"AVeRPhF67FG0uL66DobM","_source":{"title":"FTC in talks with Apple over health data protection – today's Open Thread","author":"Stuart Dredge","image":"61fd5c1d41598b0f0051e29e068dcd025ba92cd7.jpeg","category":"AVeQybI27FG0uL66Doa2","content":"Apple’s new Health app – and the HealthKit platform that lets other companies’ health and activity-tracking apps tie into it – was one of the big new features in its iOS 8 software, which launched a couple of months ago.\r\n\r\nHealth is capable of collecting, storing and analysing a range of personal data, but there are clear privacy implications here – for Apple and any company involved in this space, from Google and Microsoft to the growing number of smaller fitness-focused app and device makers.\r\n\r\nAccording to Reuters, the US Federal Trade Commission is alive to the issues. It reports that the FTC is “seeking assurances from Apple that it will prevent sensitive health data collected by its upcoming smartwatch and other mobile devices from being used without owners’ consent”.\r\n\r\nThe report also claims that Apple is stressing during the conversations that it will not be selling health data to third parties like advertisers, with spokesperson Trudy Muller telling Reuters that “we designed HealthKit with privacy in mind”.\r\n\r\nThis is less an Apple issue than it is a wider regulatory challenge, when health data is heavily protected if it’s gathered in a medical context, but much more of a grey area when it’s gathered by an app and\/or device.\r\n\r\nSo, questions: if you’re using health-tracking apps and gadgets, are you thinking about the privacy of your data? Have you dug into the providers’ privacy policies and found anything reassuring or worrying?\r\n\r\nAnd if you don’t use these apps and devices, is privacy one of the reasons? What are your concerns, and how would you like to see technology firms and regulators alike approaching the issue? The comments section is open for your thoughts.\r\n\r\nSome more stories ripe for discussion today:\r\n\r\nHachette and Amazon have settled their long-running dispute, agreeing that the book publisher will have “full responsibility” for setting its ebook prices on Amazon’s Kindle Store. Watch now for the ripples as other publishers react.\r\nSamsung is apparently spending “tens of millions” developing a new shortform video service codenamed Volt, which would try to take on YouTube with exclusive content and, possibly, music. Although YouTube has plenty of both, so it would be a tough challenge.\r\nThis is a really interesting use of Oculus Rift and virtual reality: Canadian environmental group Dogwood Initiative is using the technology to show what an oil tanker spill near Vancouver might look like, and how it would affect the city.\r\n“The men are coming to Pinterest” reports TechCrunch. Apparently men now account for a third of all new signups to the site, whose gender split has traditionally been 70-30 or 80-20 in favour of women. And in countries like India, Japan and South Korea, the split is now 50-50.\r\nFinally, Tubefilter and OpenSlate have published their latest chart of the top 100 games channels on YouTube. It’s another reminder of just how popular games are on the service, with 4.6bn views for the top 100 alone. No surprises for guessing who’s top: PewDiePie.\r\nWhat else? The comments section is open for your thoughts on the stories above, and your suggestions of other links worth reading.","created_at":"2016-10-04T19:49:06+0000","updated_at":"2016-10-04T19:49:06+0000","comments":[],"url":"\/article\/ftc_in_talks_with_apple_over_health_data_protection__todays_open_thread\/"}},
{"_type":"article","_id":"AVeRQfo47FG0uL66DobO","_source":{"title":"Nike will raffle off its super limited edition ‘Back to the Future’ kicks for a good cause","author":"Brian Heater","image":"60417cb14245f38bca31dfc0b881c890eb0b2795.jpeg","category":"AVeQybI27FG0uL66Doa2","content":"When Nike said it was making the 2016 version of its Back to the Future-inspired limited edition, the company wasn’t messing around. Only 89 pairs of the self-lacing shoes will be released to the public (likely not a coincidental nod the year the futuristic sequel was released), portioned out to eager buyers by way of an online raffle.\r\n\r\nAs with the 2011 version of the project, the new Nike Mags were designed for a good cause. In order to be in the running for a pair, interested parties need to donate $10 to the Michael J. Fox Foundation. Individuals can donate as many times they want, with proceeds going to help fight Parkinson’s Disease.\r\n\r\nThe drawing starts October 4 and is open primarily to the US and Canada. Winners will be notified on October 17. Nike will also be holding live auctions in Hong Kong, London and New York in coming months.\r\n\r\nThose who don’t score one of the extremely limited pairs, meanwhile, will have to settle for the next best thing.","created_at":"2016-10-04T19:53:22+0000","updated_at":"2016-10-04T19:53:22+0000","comments":[],"url":"\/article\/nike_will_raffle_off_its_super_limited_edition_back_to_the_future_kicks_for_a_good_cause\/"}},
{"_type":"article","_id":"AVeRQFDh7FG0uL66DobN","_source":{"title":"GE, Bosch Combine Resources to Bolster IoT","author":"Jack M. Germain","image":"8e2787221b937e8d2206fc24368815b348655962.jpeg","category":"AVeQybI27FG0uL66Doa2","content":"GE and Bosch Software Innovations this week announced a partnership to jump-start the development of an open source Internet of Things platform.\r\n\r\nOpen source will encourage greater interoperability and application development, the companies said. Both firms have sought help from the Eclipse Foundation to speed up the process.\r\n\r\nUnder the agreement, the companies will create a core IoT stack comprised of open source software. The stack will provide interoperability between GE's Predix operating system and the Bosch IoT Suite.\r\n\r\nGE Digital and Bosch Software Innovations will develop complementary software services for each other's cloud platforms to improve services for a wider customer base.\r\n\r\n\"This is a high-value initiative that should be of great interest to the Java, IoT and embedded developer community,\" said Azul Systems CEO Scott Sellers.\r\n\r\n\"The Eclipse Foundation has been at the forefront of helping to improve the IoT developer ecosystem for some time, and this is a continuation of that trend,\" he told LinuxInsider.\r\n\r\n\r\n\r\nExploratory Venture\r\n\r\nThe goal is more to test the waters than push for leadership in creating an open source IoT standard, said Matt Jennings, regional president of the Americas for Bosch's Software Innovations division.\r\n\r\n\"Creating an open source standard from this partnership will have to be determined,\" he told LinuxInsider.\" We have to study the progress of the industrial Internet and make a determination if we can come up with a common form that will make sense in those environments.\"\r\n\r\nThat exploratory attitude led to the partnership. The companies approached the common effort as two large industrial firms aspiring to support the IoT, Jennings said.\r\n\r\n\"It started to make sense, since we are both contributing to the Open Source Alliance, that we should start working together to eliminate redundancy,\" he explained. \"We could then do better work and work faster.\"\r\n\r\nThe Fine Print\r\n\r\nThe software development includes enhancing work on several existing open source projects under the Eclipse Foundation. The software involves creating code for messaging, user authentication, access control and device descriptions, according to GE.\r\n\r\nNot all of the software associated with the existing platforms at GE and Bosch may be open-sourced, however. Both companies probably will retain some parts of their existing software.\r\n\r\n\"We will have to determine where those areas of proprietary software are. I suspect that we will each retain certain properties,\" said Jennings.\r\n\r\nThe Eclipse Foundation may come into play more prominently on connectivity issues. The foundation's projects that focus on device connectivity include Eclipse Hono, Eclipse Vorto and Eclipse Leshan. Other Eclipse projects are GE-enhanced User Account and Authentication and Eclipse Access Control Service.\r\n\r\nThe GE and Bosch partnership is an interesting development, said Charles King, principal analyst at Pund-IT.\r\n\r\nIf the Internet of Things is going to work as envisioned, it needs to be based on open technologies supporting collaborations like the one announced by GE and Bosch, he suggested.\r\n\r\n\"In essence, the companies have agreed to pool their software resources to enable the integration of their own platforms and devices,\" King told LinuxInsider, and they \"will leverage Eclipse Foundation technologies to keep things on the up and up. In contrast, IoT solutions based on proprietary technologies or a single vendor's platforms are virtually guaranteed to be limiting and prone to locking in customers.\"\r\n\r\nA Desperate Need\r\n\r\nThe need surrounding this IoT initiative is clear, noted Azul Systems' Sellers. It responds to a need for more high-quality tools and developer platforms backed by innovation.\r\n\r\nThat only helps \"accelerate the development of new devices and new gateways throughout the IoT,\" he said.\r\n\r\nBoth GE and Bosch have developed Cloud Foundry and microservices-centric platforms, so the level of interoperability should be very strong, Sellers added.\r\n\r\nSuccess Not Guaranteed\r\n\r\nCompanies like GE, Bosch and others have a great deal to win or lose based on how they deliver IoT to the market, according to Don DeLoach, CEO of Infobright.\r\n\r\nThat enables them to deploy IoT solutions that can facilitate leveraging the underlying utility value of their IoT data to maximize leverage and insight, he pointed out.\r\n\r\n\"While the idea of controlling relationships by locking in customers with proprietary platforms may have short-term appeal, the major players in IoT who see the long view of the market recognize the imperative for organizations using IoT solutions to interoperate,\" DeLoach told LinuxInsider.\r\n\r\n\"I applaud the initiative and direction of GE and Bosch shown by this initiative,\" he said.\r\n\r\nThe partnership gives GE and Bosch reach across global markets and industries. The resulting efforts should be both powerful and flexible, noted Pund-IT's King.\r\n\r\n\"That should be particularly welcome among manufacturers and companies that wish to adopt an IoT platform and strategy that extends across all of their markets and areas of interest. The fact that GE and Bosch's platform is not dependent on any specific IT platform will also appeal to companies that hope to avoid being locked into relationships with specific vendors,\" he said.\r\n\r\nLimiting Factors\r\n\r\nAs with all open source initiatives, the balance is between free downloads and an ability to secure long-term support as needed, either from the Eclipse -- and Bosch\/GE -- developer community or direct from the vendors themselves, Sellers said.\r\n\r\nThe project is in very early days. Any number of barriers may spring up during the development process, noted King.\r\n\r\n\"It will also be interesting to see which, if any, vendors actively support or resist the collaboration,\" he said. \"The more the merrier, as they say, but some may consider what GE and Bosch propose as a threat to their own IoT hope and ambitions.\"","created_at":"2016-10-04T19:51:33+0000","updated_at":"2016-10-04T19:51:33+0000","comments":[],"url":"\/article\/ge_bosch_combine_resources_to_bolster_iot\/"}},
{"_type":"article","_id":"AVeYHP9v7FG0uL66Dobv","_source":{"title":"Myanmar abolishes law used to jail dissidents","author":"Paper Chase","image":"62ba167ec0cd280d670bf7bd8e7ccdd884f215de.jpeg","category":"AVeQyTlo7FG0uL66Doa0","content":" Myanmar [BBC profile] has abolished a law from 1950 that was used by the military to jail dissidents within the country. Myanmar's President, Htin Kyaw, signed new legislation abolishing the Emergency Provisions Act [text, PDF] on Tuesday. The Act provided the military the ability to impose seven-year prison terms for those deemed to be dissidents. Such behavior could include reading foreign papers or watching foreign new services. The Act was introduced in 1950 after Myanmar had attained independence from Britain. In order to combat ethnic insurgencies. U Aung Kyi, the chairman of a Parliamentary panel that helped draft the legislation, stated [NYT report] \"We have abolished the Emergency Provisions Act because it was the tool used by military regimes to suppress political dissidents\" and \"does not fit with the current situation of democratization in the country.\"\r\n\r\nHuman rights has been on the forefront of Myanmar's new democratic government since ending a decades-old military rule. The UN Office of the High Commissioner for Human Rights released a report in June stating that human rights abuses against the Rohingya in Myanmar may amount to crimes against humanity [JURIST report]. Also in June UN Secretary-General Ban Ki-moon expressed [JURIST report] shock at the increasing number of children recruited and killed in armed conflicts in several countries; the government of Myanmar alone released [JURIST report] 46 underage child recruits from the military in March as part of a UN join action plan made in 2012. In May Human Rights Watch urged [JURIST report] the Myanmar Parliament to reconsider a proposed law that they say has the advocacy organization says has the potential to limit free expression and peaceful assembly. Also in May US Secretary of State John Kerry offered support to Myanmar's newly democratic government and urged [JURIST report] the country to push more democratic reform and address human rights issues.","created_at":"2016-10-06T05:46:24+0000","comments":[],"url":"\/article\/myanmar_abolishes_law_used_to_jail_dissidents\/"}},
{"_type":"article","_id":"AVeYwhxa7FG0uL66Dob3","_source":{"title":"Amnesty calls on wealthy nations to assist in refugee crisis","author":"Miracle Jones","image":"6c7debe47ab9b879dfa8fb5c62edb6e36786b127.jpeg","category":"AVeQyTlo7FG0uL66Doa0","content":" <p>Amnesty International (AI) [advocacy website] on Tuesday called [press release] on wealthy nations to become more active in solving the refugee crisis after discovering that 10 nations making up less than 2.5 percent of the world's GDP have taken in more than half of all resettled persons. AI released a study [study, PDF] that found that rich nations have refused to take an active part in assisting refugees, which is making the crisis worse. The study found that the current resettlement is unsustainable as many countries are overwhelmed with assisting the 21 million refugees. The study further detailed that the refugee crisis is extending to all parts of the globe due to economic unrest and conflict. AI called on nations to take a greater interest in the crisis to assist in mitigating the burden on neighboring states.<\/p>\r\n\r\n<p>\r\nAmnesty International is proposing a fundamental reform to the way in which states share responsibility. Our proposals are simple: introduce a system that uses relevant, objective criteria to show each state what their fair share looks like. Then use these criteria to address critical dimensions of the current global refugee crisis. Our proposal focuses on two key dimensions of the global refugee problem: resettlement of vulnerable refugees and alleviating pressure on host states that receive very large numbers.\r\nAI urged world leaders to \"enter into a serious, constructive debate.\"\r\nStates' response to the refugee crisis has varied. Low voter turnout invalidated [JURIST report] a weekend referendum in which Hungarian citizens voted to oppose any EU mandatory placement of refugees. UN High Commissioner for Human Rights Zeid Ra'ad Al Hussein in September urged [JURIST report] the former Yugoslav Republic of Macedonia to end its pattern of expelling and detaining migrants contrary to international standards. A spokesperson for the UN Office of the High Commissioner for Human Rights in August reiterated [JURIST report] previous calls to Australia to end offshore detention on Nauru.<\/p>","created_at":"2016-10-06T06:50:40+0000","comments":[],"url":"\/article\/amnesty_calls_on_wealthy_nations_to_assist_in_refugee_crisis\/"}},
{"_type":"article","_id":"AVeYxvZ17FG0uL66Dob5","_source":{"title":"Sorry, Elon Musk! Boeing says it will win race to Mars","author":"Jethro Mullen","image":"2173294e6227f4b9a809c1e08f3ff4f054138ff0.jpeg","category":"AVePy-G67FG0uL66Doat","content":"oeing (BA) CEO Dennis Muilenburg says his company plans to beat Musk's SpaceX to the Red Planet.\r\n\"I'm convinced that the first person to step foot on Mars will arrive there riding on a Boeing rocket,\" he told an innovation conference in Chicago.\r\nHis comments come a week after Musk set out his own plans to colonize Mars. The SpaceX CEO has said he wants to send humans to the planet in 2024, with the spacecraft touching down in 2025.\r\nBesides Mars, Muilenburg also talked about other ambitious ideas at the Chicago conference, like hypersonic travel that would take people \"anywhere in the world in a couple of hours.\"\r\n\"Over the last 100 years ... men and women went from walking on the Earth to walking on the Moon,\" he said. \"But when I look ahead to the next century, I think the opportunity for innovation and big change is even greater.\"\r\nRelated: Boeing and SpaceX in private space race\r\nBoeing and SpaceX are already competing to be the first private company to carry U.S. astronauts into space. Both already have contracts with NASA to take astronauts to the International Space Station.\r\nSpaceX appeared to have gained an edge in May when Boeing said it had pushed the date of its first manned space mission back to 2018 from 2017.\r\nBut Musk's firm suffered a setback on Sept. 1 when one of its rockets was destroyed in an explosion on the launch pad. The company is still trying to figure out what caused the fiery blast, but it's planning to return to space as soon as November.","created_at":"2016-10-06T06:55:58+0000","comments":[],"url":"\/article\/sorry_elon_musk_boeing_says_it_will_win_race_to_mars\/"}},
{"_type":"article","_id":"AVeYyuF87FG0uL66Dob7","_source":{"title":"NSA leak: Booz Allen shares drop on arrest of contractor","author":"Matt Egan","image":"295dd7206df8f650cca7d3dd5a12430323252a3a.jpeg","category":"AVePy-G67FG0uL66Doat","content":"Shares of Booz Allen (BAH) dropped 4% on Wednesday after the Justice Department revealed that government contractor Harold Thomas Martin III was arrested in August and accused of stealing top-secret intelligence.\r\nBooz Allen confirmed in a statement that Martin, like Snowden, worked at the 102-year-old company, which makes money providing technical services to the NSA and other government agencies.\r\nAccording to the Justice Department, Martin is believed to have stolen top secret information that if disclosed \"could be expected to cause exceptionally grave damage to the national security of the United States.\"\r\nMartin worked at Booz Allen as a contractor to the NSA, a law enforcement source told CNN.\r\nBooz Allen said it fired Martin as soon as it learned of his arrest. The company offered the FBI \"total cooperation.\" An lawyer for Martin did not immediately respond to a request for comment.\r\nBooz Allen stressed that there has been \"no material change\" to its roster of clients as a result of this \"serious matter\" and the alleged conduct \"does not reflect our core values.\"\r\nBut Wall Street is betting that another alleged NSA leaker at Booz Allen, just three years after the historic leak executed by Snowden, could hurt Booz Allen's business.\r\n\"They will get a lot of attention, even if they did nothing wrong,\" Stewart Baker, a former general counsel at the NSA, told CNBC.\r\nIt Booz Allen is revealed to have made mistakes checking Martin's background, \"it's going to go pretty badly for them,\" he said.\r\nOn Twitter, even Snowden made the connection between himself and Martin. But he suggested that just because they both worked at Booz Allen doesn't mean the circumstances are the same.","created_at":"2016-10-06T07:00:15+0000","comments":[],"url":"\/article\/nsa_leak_booz_allen_shares_drop_on_arrest_of_contractor\/"}},
{"_type":"article","_id":"AVeRKqFZ7FG0uL66DobD","_source":{"title":"Scarface Talks His Eight-Year Vice in New 'Golf Lives' Documentary","author":"Gail Mitchell","image":"b4e744c427fa3e240fc7328ac0437a259dbc8125.jpeg","category":"AVeQyYE57FG0uL66Doa1","content":"You’re liable to run into the most unexpected people on a golf course these days. Just ask Brad Jordan. Or as he’s known in rap circles: Scarface.\r\n\r\n“Yeah, it’s a sickness,” says Scarface with laugh. “I’m in Houston on the golf course doing 18 holes every day that I don’t have to work or it rains.”\r\n\r\nThe rap icon’s avid pursuits on the green are the focus of Golf Lives. Premiering today (Oct. 4), the short-form documentary is produced by VICE Sports and distributed via Callaway Golf channels.\r\n\r\n“Golf Lives is about showcasing the broad appeal of golf by chronicling the immersion of an unexpected and interesting character into Callaway’s world of product performance and innovation,” explains Harry Arnett, senior vp of marketing & brand management for Callaway Golf. Adds VICE Sports publisher Will Kiersky, “We wanted to make a statement and bring someone into the fold with both real credibility in the rap world and a deep passion for golf to see what happened. Scarface was the perfect fit for this.”\r\n\r\nThe link between rap and golf isn’t as surprising as some may think. “There are a lot of hip-hoppers who play golf,” says Scarface, ticking off such names as Drez of Black Sheep (“a hell of a golfer”) and Luther Campbell. Scarface’s own love affair with the sport began eight years ago when his then 14-year-old daughter beat him in a round.\r\n\r\n“She was taking lessons and wanted me to buy her some clubs,” recalls Scarface, a fan of golf champion Phil Mickelson. “I bought clubs for myself as well, thinking this was an easy game and I could show my daughter that daddy can do anything. Boy, was I wrong.”\r\n\r\nScarface says he now probably shoots between 11 and 9 (“It’s better than average”). But above all, he loves that golf presents a “different-than-life challenge. I don’t care how long you play it, you’ll never ever master this game. There will always be something from one day to the next. All you can hope to do is enjoy it.”","created_at":"2016-10-04T19:27:52+0000","updated_at":"2016-10-04T19:27:52+0000","comments":[],"url":"\/article\/scarface_talks_his_eightyear_vice_in_new_golf_lives_documentary\/"}},
{"_type":"article","_id":"AVeRL0n77FG0uL66DobG","_source":{"title":"Fred Durst & Linkin Park's Chester Bennington Toast Sobriety at Mike Ness Tribute Concert","author":"Steve Baltin","image":"655b8625d15b5be2df00fa511c6b0a09c565aafe.jpeg","category":"AVeQyYE57FG0uL66Doa1","content":"A packed roster of musicians came out to L.A.’s Fonda Theater on Sunday night (Oct. 2) for the first annual Rock To Recovery, a benefit helping musicians with their sobriety. For acts like Linkin Park frontman Chester Bennington and Limp Bizkit’s Fred Durst -- both of whom appeared in an all-star jam spearheaded by the Cult's Billy Morrison -- supporting sobriety was a big reason to come out. The other was to be on hand to pay tribute to the night’s guest of honor, Social Distortion leader Mike Ness.\r\n\r\n“Dude, Social Distortion played such a huge part in my musical life, huge, huge, huge,” a visibly excited Bennington told Billboard backstage. “’Mommy’s Little Monster’ was probably one of the most pivotal songs in my early life ‘cause I loved that track so much. It turned me on to Social Distortion, turned me on to Misfits, so much great punk music.”\r\n\r\nDurst, who rocked Rage Against The Machine’s “Killing In The Name Of” while Bennington stood side stage and pumped his fist and sang along to every word, told Billboard he couldn’t perform a Social D song out of respect for the greatness of the songs. \r\n\r\n“I wouldn’t do any of them, too big of a fan,” Durst said. “He writes incredibly universal themes in his songs and melodies, but he’s putting this incredible background he owns for himself. These songs are really good.” \r\n\r\nAs the man of the moment, Ness was flattered, but a little overwhelmed by the attention and surprised at being honored for sobriety that began 31 years ago this month. “I would’ve never expected this at all, having this much time clean and sober or having a rock and roll event that celebrates this because when I got clean it wasn’t cool to be clean,” he said.\r\n\r\nHowever, Ness recalls he had no choice. “I got sober October, 1985 and sex, drugs and rock and roll had turned to sex and drugs, then just drugs,” he recalled. “People were walking out of shows, all the band’s gear was in the pawn shop. I was either in jail or missing and the band was falling apart. When I got clean I didn’t really know if I was going to be able to do it.”\r\n\r\nOver the years, Ness, one of punk’s great poets, has put those tales into his music again and again, something Bennington admires greatly. “He’s one of the greatest songwriters of our time. He took punk music and made it acceptable, and not just punk music, but really tough s--t,” Bennington said. “Mike didn’t talk about things that were easy. He talked about going to prison, his abuse, he talked about his life and the troubles.”\r\n\r\nEspecially at Rock To Recovery, an organization founded by Wesley Geer (Hed P.E. and Korn), who hopes to turn the success of the inaugural event into a yearly tradition and potentially a branded tour down the road. Those troubles were on the forefront of people’s minds, particularly Bennington, who is passionate about helping those with substance abuse problems.\r\n\r\n“I really advocate for guys who are struggling in the prison system. I think that our prison system is chock full of people who have substance abuse problems and can actually be helped much more by actual rehab,” said Bennington. “Personally I’d rather use my tax money to send people to rehab than prison because they sit there and do nothing. I believe that prison hurts people and fortunately some of us get to live through those stories. And fortunately, for us, Mike Ness has lived through many of those stories, told us his life, we’ve been able to feel his pain, feel his triumph and feel all that good stuff. He’s a miracle, man.”\r\n\r\nFor Durst, celebrating sobriety and Ness was just what he wanted on this night. “At an event like this there are positive and incredible vibes in the air,” he said. “It’s a long drive from Hidden Hills but that was awesome. I’m ready to go get a milkshake now, a vegan milkshake.”","created_at":"2016-10-04T19:32:57+0000","updated_at":"2016-10-04T19:32:57+0000","comments":[{"number":0,"commenter":"admin","comment":"Something to listen to","date":"2016-10-06T08:29:11+0000","likes":1}],"url":"\/article\/fred_durst__linkin_parks_chester_bennington_toast_sobriety_at_mike_ness_tribute_concert\/"}},
{"_type":"category","_id":"AVePy-G67FG0uL66Doat","_source":{"name":"Bussiness","premium":true,"url":"\/categories\/bussiness"}},
{"_type":"category","_id":"AVeQyYE57FG0uL66Doa1","_source":{"name":"Music","premium":false,"url":"\/categories\/music"}},
{"_type":"category","_id":"AVeQybI27FG0uL66Doa2","_source":{"name":"Technology","premium":false,"url":"\/categories\/technology"}},
{"_type":"category","_id":"AVeQyf2Q7FG0uL66Doa3","_source":{"name":"Photography","premium":false,"url":"\/categories\/photography"}},
{"_type":"article","_id":"AVeRLOGf7FG0uL66DobE","_source":{"title":"Billy Talent Frontman Talks 'Giddy' Guns N' Roses Opening Slot, Gives Update on Drummer's MS Battle","author":"Karen Bliss","image":"9d2286da68aa5515644edec648d0e499c9229ed7.jpeg","category":"AVeQyYE57FG0uL66Doa1","content":"Canadian rock band Billy Talent, named after a character in the punk novel and film Hard Core Logo, built its way to arena status in Canada by putting on consistently killer live shows, starting in small venues like Toronto’s Horseshoe and the Bovine.\r\n\r\nFrontman Ben Kowalewicz, guitarist Ian D’Sa, drummer Aaron Solowoniuk and bassist Jon Gallant -- all childhood friends -- are notoriously nice guys, although onstage Kowalewicz is an intense mother, bounding around like an uncaged animal and pausing between songs to give commentary on how we should love each other or talk about social causes.\r\n\r\nThe band is currently touring behind its fifth album, Afraid of Heights, out on The End Records in the U.S. Unfortunately, drummer Solowoniuk is temporarily sitting out the dates because of his multiple sclerosis, which he’s had since his teens, while Alexisonfire’s Jordan Hastings fills in.\r\n\r\nBillboard spoke with Kowalewicz about opening for Guns N’ Roses, being on the same page lyrically and how Aaron is doing.\r\n\r\nYou opened up for Guns N’ Roses at one of Canada’s biggest venue, Rogers Centre, in front of a sold out crowd of 50,000 in your hometown and you look like you belonged up there.\r\nThank you. What a wonderful night, huh?  It was magical. That’s the only way I can describe it. It is definitely one that I will not forget any time soon. Four lads being from Mississauga and playing SkyDome [its former name] is obviously a dream come true, literally a dream come true.\r\n\r\nHow do you prepare to play a venue that’s so huge and reach those people in the 500 level?\r\nWe’ve had the fortune of playing big festivals across Europe with 80-to-110,000 people. So we have played in front of big crowds. It’s a different when it’s a dome because they’re everywhere, as high as you look and as close as you can get, right in front of the stage. We just got up there and did our thing. We turn it up loud and have fun.\r\n\r\nYou’ve obviously attended shows and baseball games there.\r\nI go to [Toronto Blue] Jays games as regularly as I can. I’m a huge Jays fan. One of the great things about the evening was our dressing room was in the away team’s dugout behind us, so we got to sit in the dugout and drink beer and watch GNR play. I was just giddy.\r\n\r\nDid you get to meet them?\r\nNo. We had a chance to hang out with Duff [McKagan] quite a few times. We did some touring with his band in Australia as part of this festival and we did our own show in Sydney and he was like, \"Can I come to your show?\" \"Yes, you can.\" He came to the show and we hung out with him. He’s an absolute gentleman and such a lovely, lovely dude. He seems to really enjoy the band. A little daunting when you’re singing and you’re looking at the front of house board and there’s Duff standing there. I am assuming somewhere down the line, that’s how we maybe got the call. I haven’t spoken to him about it. But I think he might have influenced the powers that be to get us put us on the bill. I was just sitting in my hotel room one day and I got the email that said they wanted us to play and there was a lot of fist-pumping and high-fiving going on.\r\n\r\nA lot has happened in the world since you released your last album  [2012’s Dead Silence] -- gay marriage was legalized in the States; Trump is a presidential nominee; the rise of ISIS; death of Bowie, Prince and Lemmy.  That’s a lot of fodder for someone like you. \r\nNot just for me. For everyone.  It’s been a very turbulent, trying, sad, tragic year, and needless to say, every time you turn on your computer or flip on the TV, there’s some awful thing happening somewhere. This record, Ian, more so than before, is the main songwriter in the band and he definitely took a lot of the charge for the lyrics. He produced the record as well. So this is definitely his brainchild and I’m also very proud of him, I should also note. \r\n\r\nWhen we started working on putting the lyrics together, he already had a lot of ideas sketched out.  It’s definitely has a lot of tough topics we address on the record, but the one thing we feel that we’ve accomplished on the record, we discuss a lot of these horrible, awful things that happen, but at the end of the day I think the record represents that there’s still hope, and that we’re like-minded people and together in this, and with love and compassion and tolerance and empathy and the beliefs in the greater good that we’re going to get through all this stuff and come out the other side as better versions of people we were before.  \r\n\r\nIt’s really hard because I feel right now that everyone’s scared. There’s just fear. There’s this rampant fear that is running through every culture and geographically, no matter where we’re at, and having spent time in Europe and talking to these people, there’s this fear. And throughout history, when fear is your main modus operandi, that’s when things go really wrong really quickly. But on the flip side of that, I also think things can improve just as quickly. We’re all just passengers riding on this planet together. We just try to have fun and we believe that music is a very cathartic thing and so we hope enjoy the tunes. I think it’s the best sounding and the best songs that we’ve written in a really long time so we hope people dig it.\r\n\r\nObviously, you are life-long friends and probably he main reason is you all views these issues similarly, which is important if you have to sing songs and Ian is writing the bulk of them. \r\nIt’s true. We’re all morally aligned. We hold the same values. We believe in the same things. So when there are songs with some heavy subject matter, it’s not just me and Ian; we talk about it with the band. It’s very transparent.\r\n\r\nAaron has to sit out of the band right now because of his MS and that news delayed the recording a bit.\r\nThere were some time things that were affected, obviously due to Aaron’s situation. That was the reason we pushed the recording back, and then we started in January. I don’t know if that was the best idea or one that we’ll do again. It’s a hard month to start recording. You have the new year and the weather is shit and we were going in to the studio without Aaron so it was strange. There were just a lot of oddities and it ended up smoothing itself out over time, but it was a hard month. I don’t think we’ll do that again. But the best thing about this record and the many great things is that we got to record the whole thing in Toronto for the first time. That was really special to be able to go home and sleep in our own beds and go to our studio where there were no time constraints. We could work as much or as hard or as little as we wanted.\r\n\r\nHow is Aaron? Did he see you play with Guns? \r\nYes he was there.  He has a team of people who are working with him whose goal is to get him back on the drums; he’s feeling inspired and optimistic again and he believes that he can do this and we believe that he can do this as well.","created_at":"2016-10-04T19:30:20+0000","updated_at":"2016-10-04T19:30:20+0000","comments":[],"url":"\/article\/billy_talent_frontman_talks_giddy_guns_n_roses_opening_slot_gives_update_on_drummers_ms_battle\/"}},
{"_type":"article","_id":"AVeRMZ6u7FG0uL66DobI","_source":{"title":"Uber clarifies data privacy policy as controversy rumbles – today's Open Thread","author":"Stuart Dredge","image":"67cbd670f8313aa91ff9014478017e14fa61baa4.jpeg","category":"AVeQybI27FG0uL66Doa2","content":"The story that broke earlier in the week about an Uber executive threatening to investigate critical journalists’ private lives rumbles on, with the company providing a couple of official responses yesterday.\r\n\r\nFirst, chief executive Travis Kalanick went on a tweetstorm with 13 tweets addressing the issue, although while it concluded with a direct apology to Sarah Lacy, the journalist targeted in the original comments, as Valleywag points out, there were several questions he didn’t answer.\r\n\r\nAs time has gone by, journalists have been focusing on another aspect of the original BuzzFeed report that kicked off this debate – the claim that an Uber exec had “accessed the profile of a BuzzFeed News reporter, Johana Bhuiyan, to make points in the course of a discussion of Uber policies” without their permission.\r\n\r\nUber has now published a blog post which it says aims to “make very clear our policy on data privacy, which is fundamental to our commitment to both riders and drivers”. It refers to a “strict policy prohibiting all employees at every level from accessing a rider or driver’s data” except for “legitimate business purposes”.\r\n\r\nTechnology journalists are, unsurprisingly, questioning whether Uber’s radar for what constitutes “legitimate business” has been malfunctioning for some time. But how are you feeling about Uber and other companies of its type, in regards to privacy?\r\n\r\nDo you worry about the way your data fits into the “sharing economy”, or do the benefits of services like Uber and Airbnb trump any concerns that your records will be used against you in the future? Is this a specific issue between journalists and Uber, or is this controversy going to put non-hacks off using the company too?\r\n\r\nThe comments section is open for your thoughts.","created_at":"2016-10-04T19:35:30+0000","updated_at":"2016-10-04T19:35:30+0000","comments":[],"url":"\/article\/uber_clarifies_data_privacy_policy_as_controversy_rumbles__todays_open_thread\/"}},
{"_type":"article","_id":"AVeYHuuP7FG0uL66Dobw","_source":{"title":"Massachusetts top court extends parental rights to unmarried same-sex partner","author":" Steven Wildberger","image":"e9c3d00bec30ba9db3937f36b28ef583c3cff224.jpeg","category":"AVeQyTlo7FG0uL66Doa0","content":"The Massachusetts Supreme Judicial Court [official website] on Tuesday ruled [opinion, PDF] that same-sex couples that never marry are entitled to the same parental rights as heterosexual couples. This decision arose out of a suit seeking parental rights filed by Karen Partanen, former partner of Julie Gallagher, who was impregnated by artificial insemination. The couple ended their relationship when their children were one and five years old, respectively. The court held that because Partanen was intimately involved in raising the children, she should have the same rights as any person would as a member of a heterosexual relationship.\r\n\r\nThe rights of same-sex couples, and same-sex parents in particular, have been particularly contentious of late. Earlier this month, Alabama Supreme Court Justice Roy Moore was removed from the bench [JURIST report] for issuing an order preventing magistrate judges of that state from issuing marriage licenses to same-sex couples, in direct contravention of a federal order requiring same. In September the North Carolina Court of Appeals affirmed [JURIST report] a lower court's dismissal of a claim by two former magistrates that their rights were violated by 2014 guidance memos from the Administrative Office of the Courts that said they could be fired if they refused to perform same-sex marriages. Earlier that month, tens of thousands of people marched in Mexico [JURIST report] to protest a same-sex marriage recognition proposal. In August, the Belize Supreme Court struck down [JURIST report] a law banning sodomy, declaring it unconstitutional and adversely impactful to the LGBT community.","comments":[],"url":"\/article\/massachusetts_top_court_extends_parental_rights_to_unmarried_samesex_partner\/"}},
{"_type":"article","_id":"AVeRJvwF7FG0uL66DobB","_source":{"title":"John Mayer Trio, Jon Batiste & More to Perform at Jazz Foundation's 'A Great Night in Harlem'","author":"Gail Mitchell","image":"e1f481b3dcff82a9c61f9b9cb54185c0fa927a3e.jpeg","category":"AVeQyYE57FG0uL66Doa1","content":"The Jazz Foundation of America (JFA) announced on Tuesday (Oct. 4) a campaign to raise $1 million in relief funds for musicians needing assistance in the wake of the devastating floods in southern Louisiana. In addition, the JFA will host its 15th annual “A Great Night in Harlem” gala benefit on Oct. 27 at New York’s Apollo Theater. Among the performers paying tribute to gala honoree Dr. John will be the John Mayer Trio and Jon Batiste.\r\n\r\nThe flooding damaged more than 60,000 homes and displaced 20,000 people. lJFA executive director Wendy Oxenhorn notes that affected musicians’ immediate needs over the next six months fall into three major categories: paying mortgages, replacing instruments and decontaminating homes. “It's hard enough to be a musician in these times when everyone listens to music alone, on a device, and live music is always fighting to keep its head above water,” she explains. “But when you have a disaster such as this, just like with Katrina, we can't possibly keep up with the need without raising extra funds.”\r\n\r\nAmong the musicians being helped is 91-year-old Henry Gray, a blues piano player and singer whose credits include performing with the Rolling Stones, Muddy Waters and Howlin’ Wolf plus 58 albums including recordings for Chess Records. Because of the floods, Gray had to walk away from his beyond-repair home—which he purchased only a few years ago.\r\n\r\nThere’s also Kevin Harris, tenor saxophonist with the Dirty Dozen Brass Band, which will celebrate its 40th anniversary next year. The floods hit two days before his intended move date back to New Orleans. “The JFA has done a good bit for not only me but for so many other musicians, making it possible for us to continue to do what we need to do,” says the 61-year-old.\r\n\r\nToward that end, the JFA is once again presenting its annual benefit gala “A Great Night in Harlem.” In addition to the aforementioned John Mayer Trio (featuring Pino Palladino and Steve Jordan) and Batiste, among other performers paying tribute to New Orleans icon Dr. John will be McCoy Tyner, Robert Cray, Bruce Willis and Robert Randolph. Jordan will also double as musical director. The evening will be hosted by Joe Morton (Scandal) with emcee\/fellow actor Danny Glover. Gala proceeds will support JFA’s ongoing programs and initiatives.\r\n\r\nTickets and more information are available at JazzFoundation.org\/Apollo2016. Additional details about how to support the foundation’s $1 million emergency relief effort can be found at JazzFoundation.org\/donate.‎","created_at":"2016-10-04T19:23:53+0000","updated_at":"2016-10-04T19:23:53+0000","comments":[],"url":"\/article\/john_mayer_trio_jon_batiste__more_to_perform_at_jazz_foundations_a_great_night_in_harlem\/"}},
{"_type":"article","_id":"AVeRKSCr7FG0uL66DobC","_source":{"title":"Macy Gray Signs with ICM Partners","author":"Lars Brandle","image":"140289a1554195a914bd21c85f290ccbb2e8f870.jpeg","category":"AVeQyYE57FG0uL66Doa1","content":"Grammy-winning artist Macy Gray is now a client of talent agency ICM Partners, Billboard can reveal.\r\n\r\nGray won the Best Female Pop Vocal Performance Grammy for her 1999 hit “I Try” and has collected multiple Billboard, MTV and Brit Awards over a career spanning more than 20 years. \r\n\r\nMacy Gray Wants To Abolish The 'Absurd' Sexual Double-Standard For Women\r\n\r\nThe U.S. R&B singer and actress last month dropped Stripped, her tenth album and her first jazz recording. Her next studio album is set to release early 2017.  \r\n\r\nGray also has a string of silver screen credits to her name, including scenes in the Oscar-winning Training Day (2001) Sam Raimi’s Spider-Man (2002) and 2012’s The Paperboy.\r\n\r\nGray is managed by Adam Arnkoff of Tenth Street Entertainment.","created_at":"2016-10-04T19:26:14+0000","updated_at":"2016-10-04T19:26:14+0000","comments":[],"url":"\/article\/macy_gray_signs_with_icm_partners\/"}},
{"_type":"article","_id":"AVeYyGpV7FG0uL66Dob6","_source":{"title":"Ford F-150 brakes under investigation by regulators","author":"Peter Valdes-Dapena","image":"18f44785afd41b84be355e3e3cc78a2b653e4bbf.jpeg","category":"AVePy-G67FG0uL66Doat","content":"The investigation follows a recall for the same problem, announced last May, of 225,000 model year 2013 and 2014 F-150 pickups with Ford's turbocharged 3.5-liter EcoBoost engine. The trucks involved in this new investigation have that same engine.\r\nIn the May recall, the problem was due to an internal brake fluid leak which caused a loss of brake pressure. When that happened, drivers would be alerted by warning chimes, messages and warning lights. There could also be a loss of front brake function and, consequently, longer stopping distances.\r\nRelated - Ford fact-checks Trump: We will be here forever\r\nNow, according to the National Highway Traffic Safety Administration, some drivers of 2015 trucks have complained of similar issues, with greatly reduced brake function along with warning lights and tones. Some drivers of 2016 trucks have also complained of brake problems but without any warning lights or tones.\r\nNHTSA investigators are looking into the problem to see if the recall Ford announced in May should be expanded to include the 2015 and 2016 model years trucks. If so, as many as 228,000 trucks could be added to the recall, more than doubling its scope. Until the investigation is completed, though, it's still not clear if any of those will be added to the recall.\r\nFord (F) will cooperate with NHTSA the investigation, spokesman Mike Levine said.\r\n\"We continuously evaluate our processes for potential improvements, and when the data indicates a safety recall is needed, we move quickly on behalf of our customers,\" he said.","created_at":"2016-10-06T06:57:33+0000","comments":[],"url":"\/article\/ford_f150_brakes_under_investigation_by_regulators\/"}},
{"_type":"article","_id":"AVeY0LIA7FG0uL66Dob-","_source":{"title":"In Photos: Apollo 15 and the Moon","author":"George Eastman","image":"c9f2bff4944acfdf138798c7000e4ada0b960593.jpeg","category":"AVeQyf2Q7FG0uL66Doa3","content":"July 26, 2016 \/Photography News\/ Apollo 15 embarked 45 years ago, on July 26 of 1971, and was the ninth manned mission in the Apollo program, the fourth mission to land on the Moon and the eighth successful manned mission. Two astronauts, Commander David R. Scott and LM (Lunar Module) pilot James B. Irwin, are shown during their 4 days on the lunar surface. Shortly thereafter, the Apollo 17 mission landed, in December of 1972, and would be the sixth and final mission in which humans would roam the moon. The photographs from the 17th mission include Commander Eugene A. Cernan, LM pilot Harrison H. Schmitt and CM (Command Module) pilot Ronald E. Evans. Some activities depicted in the collection of twelve images include; the retrieval of a film canister on the outside of a spacecraft, the preparation of a LRV (Lunar Roving Vehicle), collection of lunar samples and, of course, the overall exploration of the moon’s surface.","created_at":"2016-10-06T07:06:36+0000","comments":[],"url":"\/article\/in_photos_apollo_15_and_the_moon\/"}},
{"_type":"article","_id":"AVeY0nit7FG0uL66Dob_","_source":{"title":"Sigma 85mm f\/1.4 Art, 12-24mm f\/4 Art and 500mm f\/4 Sport Announcement","author":"NASIM MANSUROV","image":"64931c715e74a5e114fa9376846bdd6764af825d.jpeg","category":"AVeQyf2Q7FG0uL66Doa3","content":"More Photokina announcements are rolling in today and this time it is Sigma, with its headline-grabbing releases of upcoming Art and Sport-series lenses. With stellar lens designs such as the 35mm f\/1.4 Art and 50mm f\/1.4 Art lenses, we have been waiting for Sigma to release an 85mm f\/1.4 Art lens for quite sometime now, so Sigma has finally delivered. The new 85mm f\/1.4 Art promises to be a superb lens both in terms of sharpness and bokeh. Although Sigma is yet to provide MTF charts and lens construction images, the fact that there is no aspherical element in the lens design is an indication of the lens being optimized to yield pleasant-looking bokeh without onion rings, something that has plagued other Art-series Sigma lens designs. Its price is a bit steep at $1,199 MSRP, but it is still $400 cheaper than its Nikon counterpart.\r\nThe 12-24mm f\/4 Art looks pretty solid as well, considering that it is designed for full-frame cameras. It rivals primarily with Canon’s 11-24mm f\/4L lens rather than Nikon’s 14-24mm f\/2.8, since those extra 2mm of focal length differences are huge. And price-wise, it is not a cheap lens either – at $1,599 MSRP, it is pretty darn close to Nikon’s 14-24mm, although if you were to compare it to Canon’s $3K 11-24mm f\/4L, is is still quite a bargain. With a number of aspherical and low dispersion glass elements, this should be a stellar wide-angle lens though. As expected from such a lens design, the front element of the lens is huge, making it impossible to mount filters. You would need to get something like the WonderPana with those huge and expensive filters in order to be able to mount them.\r\nLastly, another surprise is the Sigma 500mm f\/4 Sport DG OS HSM lens, a flagship super telephoto lens designed specifically for sports and wildlife photographers. This one looks quite attractive as well, but with lack of key specifications like its weight, it is impossible to say how it will be able to compete with both Nikon’s and Canon’s flagship 500mm f\/4 lenses, both of which have fluorite elements and other optimizations to keep their weights very low. However, its street price of $5,999 definitely makes it look attractive compared to the big name brands, who sell their 500mm f\/4 lenses at much steeper prices.","created_at":"2016-10-06T07:08:32+0000","comments":[],"url":"\/article\/sigma_85mm_f14_art_1224mm_f4_art_and_500mm_f4_sport_announcement\/"}}
]